//Напишите программу, которая задаёт массив из 8 элементов и выводит их на экран.
int Input(string msg)
{
    Console.WriteLine("Enter your number to get the sum of digits in it");
 int num = Convert.ToInt32(Console.ReadLine());
}

